app/controllers/songs_controller.rb

  def new
    if !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"